Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: • calculate electrical potential and voltage
nb: • beregne elektrisk potensial og spenning

source: Lectures, flipped classroom, tests, compulsory practical group assignments with report submissions and online tests.
nb: Forelesninger, «Flipped classroom» (omvendt klasserom), prøver, obligatoriske praktiske gruppeoppgaver med rapportinnlevering og online-tester.

source: Hull and rudder design in relation to manoeuvrability, fin model testing.
nb: Utforming av skrog og ror i forhold til manøvreringsevnen, modellforsøk av finne.

source: Lectures (lectures in digital techniques will be performed online), mid-way online evaluation in programming and compulsory exercises.
nb: Forelesninger (i delemne digitalteknikk vil undervisningen foregå online) midtveis onlinetest i programmering og obligatorisk øving.

source: • describe basic communication with peripherals such as input, LCD and memory
nb: • beskrive enkel kommunikasjon med periferiutstyr som input, LCD og minne

source: The second academic year (2021-2022) is devoted to work on the Master's thesis (OPG5101).
nb: Andre studieår (2021-2022) er viet arbeid med masteroppgaven (OPG5101).

source: Understand how to plan and lead a military operation on the ground in winter conditions.
nb: Forstå hvordan en landmilitær operasjoner planlegges og ledes under vinterforhold.

source: This shall include providing training and the honing of individual skills ahead of a deployment.
nb: Herunder sørge for opptrening og repetisjon av enkeltmannsferdigheter forut for en deployering.

source: Compendiums provided by the teacher.
nb: · iRAT og tRAT gjennomføres i LMS.

source: English within Military Problem-Solving and Methods further develops the cadets’ knowledge and proficiency in English as the working language of the Royal Norwegian Air Force.
nb: Engelsk i Militær problemløsing og metode videreutvikler kadettenes kunnskap om og ferdigheter i engelsk som arbeidsspråk i Luftforsvaret.

source: The UN's basic principles for peacekeeping (consent, impartiality and non-use of force) are constantly challenged in the face of today's conflict picture.
nb: FNs grunnleggende prinsipper for fredsbevaring (samtykke, upartiskhet og ikke-bruk av makt) blir stadig utfordret i møte med dagens konfliktbilde.

source: explain the use of digital signal processing in filtering and Fourier analysis (DFT)
nb: forklare bruk av digital signalbehandling innen filtrering og fourier-analyse (DFT)

source: Axial and radial turbines.
nb: Aksial og radial turbiner.

source: The course’s final topic (1 week) focuses on national crisis management within the conflict spectrum from peace via crisis to war, including Norway's relationship with allies.
nb: Emnets avsluttende tema (1 uke) setter fokus på nasjonal krisehåndtering i konfliktspekteret fra fred, via krise til krig, og herunder Norges forhold til allierte.

source: describe the own industry's main task and role in the Air Force and as part of the Armed Forces.
nb: beskrive egen bransjes hovedoppgave og rolle i Luftforsvaret og som en del av Forsvaret.

source: use compressor and turbine maps to operate gas turbines.
nb: nytte kompressor- og turbinkart for operering av gassturbiner.

source: describe key concepts and methods in fluid mechanics, including boundary layer formation, whirls and separation, cavitation and pressure signature
nb: beskrive sentrale begreper og metoder innen strømningslæren, deriblant grensesjiktdannelse, virvler og avløsning, kavitasjon og trykksignatur

source: Contribute to ICT-related operational planning and decision-making processes, as well as processes for training and exercise development, material, teaching and interoperability
nb: Bidra til IKT-relaterte operative plan- og beslutningsprosesser, samt prosesser for utvikling av trening og øving, materiell, undervisning og interoperabilitet

source: During the course, the students will design, implement, operate and use military II, with the main focus at the tactical level.
nb: I løpet av emnet vil studentene designe, implementere, drifte og anvende militær INI, med hovedfokus på taktisk nivå.

source: The course builds on the knowledge and practical experiences the students have from MILM 1101, and also their experience and knowledge and experience from other arenas.
nb: Emnet bygger videre på innsikten i ledelse, og de praktiske erfaringene med ledelse, som kadettene fikk i emne MILM 1101 samt kadettenes tidligere erfaring og kunnskap.

source: During the training, cadets will acquire the competence required to see their respective specialist skills (cadres) and leadership (decisions) in an overall perspective/system perspective (at the tactical, operational, military strategic and political levels).
nb: Under utdanningen skal kadettene tilføres kompetanse slik at de kan se sin respektive fagkompetanse (bransjer) og lederskap (beslutninger) i et helhetsperspektiv/ systemperspektiv (taktisk, operasjonelt, militærstrategisk og politisk nivå).

source: Your development as an officer is assured through an increased understanding of your own combat arms, along with an increased ability to identify and assess contextual conditions affecting the implementation of military operations (officer identity).
nb: Offisersutviklingen ivaretas gjennom økt forståelse for eget våpen og økt evne til å identifisere og vurdere kontekstuelle forhold som påvirker gjennomføringen av militære operasjoner (offisersidentitet).

source: explain the principles for methodical and intelligible problem solving
nb: forklare prinsippene for metodisk og etterrettelig problemløsning

source: The course gives an introduction to regulations, energy production, energy distribution and electrical machines in low and high voltage installations.
nb: Emnet gir innføring i forskrifter, energiproduksjon, energidistribusjon og elektriske maskiner i lav- og høyspenningsanlegg.

source: Helicopter pilots are trained in the training department of either the US Army or the US Navy.
nb: Helikopterflygere utdannes ved utdanningsavdeling i enten US Army eller US Navy.

source: The purpose here is to provide a knowledge of processes and factors affecting development, motivation and efficiency within groups and teams.
nb: Hensikten er å gi kunnskap om prosesser og faktorer som påvirker utvikling, motivering og effektivitet i grupper og team.

source: Global and local emission regulations.
nb: Globale og lokale utslippsbestemmelser.

source: Practical language skills, reading/listening comprehension, speaking and writing skills (the four skills)
nb: Praktisk språkferdighet, lese-/lytteforståelse, tale- og skriveferdighet (the four skills)

source: The course plan is based on the IMO model course 7.03 - Officer in Charge of a Navigational Watch:
nb: Emneplanen tar utgangspunkt i IMO modellkurs 7.03 Skipsoffiserer med ansvar for en navigasjonsvakt:

source: send and receive information using the GMDSS subsystem and equipment
nb: sende og motta informasjon ved hjelp av GMDSS undersystem og utstyr

source: apply skills and relevant results from research and development work to resolve theoretical, technical and practical issues within the electrical and information technology discipline and justify their choices.
nb: anvende kunnskap og relevante resultater fra forsknings- og utviklingsarbeid for å løse teoretiske, tekniske og praktiske problemstillinger innenfor elektro- og informasjonsteknologifaget og begrunne sine valg.

source: In total 1047 pages.
nb: Totalt 1047 sider.

source: The cadets are to work in battalion groups of staff for the duration, and to utilise military problem-solving methods (military decision-making and planning (MDMP) and staff study methodology).
nb: Kadettene vil gjennom hele perioden jobbe i bataljonsstab og benytte militære problemløsningsmetoder (plan- og beslutningsprosess (PBP) og stabsstudiemetodikk).

source: explain the operation and interplay between the technical mechanisms used in defensive cyberspace operations, and the relationship with the principles of a defendable information infrastructure (INI)
nb: forklare virkemåten og samspillet mellom de tekniske mekanismene som benyttes i forbindelse med defensive cyberoperasjoner, og sammenhengen med prinsippene for en forsvarbar informasjonsinfrastruktur (INI)

source: critically analyse and apply key Western military theoretical ideas after 1970 within both the high and low intensity spectrum.
nb: kritisk analysere og anvende sentrale vestlige militærteoretiske retninger etter 1970 innen både høy- og lavintensitetsspekteret.

source: Electric low and high voltage systems.
nb: Elektriske lav- og høyspenningsanlegg.

source: Subject to approval by the Norwegian Maritime Authority.
nb: Med forbehold om godkjenning av Sjøfartsdirektoratet.

source: identify security, vulnerability, privacy and data security aspects in products and systems that use ICT.
nb: identifisere sikkerhets-, sårbarhets-, personverns og datasikkerhetsaspekter i produkter og systemer som anvender IKT.

source: The module is particularly occupied with discussing if and how air power should be applied.
nb: Emnet skal gi kunnskap om den gjensidige påvirkningen mellom luftmakt og det politiske-, strategiske-, operasjonelle- og taktiske- nivået.

source: Expected learning outcome for Bachelor in military studies with specialisation in management - Naval Engineer weapon systems, electronics and data
nb: Forventet læringsutbytte for Bachelor i militære studier med fordypning i ledelse - marineingeniør våpensystemer, elektronikk og data:

source: • Paired and unpaired models
nb: • Parede og uparede modeller

source: • balance security against the consequences of security incidents, economy and use of resources
nb: • gjøre avveininger av sikkerhet opp mot konsekvenser av sikkerhetshendelser, økonomi og ressursbruk

source: These courses will follow FHS’s/CIS’s course descriptions and the regulations relating to admission, studies and examinations at the Norwegian Defence University College.
nb: Disse emnene vil følge FHS/CISK sine emnebeskrivelser og forskrift om opptak, studier og eksamen ved Forsvarets høgskole.

source: account for and discuss the role of the Norwegian Armed Forces and the civil-military relations in a broader sense.
nb: redegjøre for og drøfte Forsvarets rolle og de sivil-militære relasjonene i bredere forstand.

source: During the entire period, compulsory skills training in Military Sports and Training (MIT) is also carried out with 2 + 2 hours per week.
nb: I hele perioden gjennomføres også obligatorisk ferdighetstrening i militær idrett og trening (MIT) med 2 + 2 timer pr uke.

source: explain key aspects of self-perception and theory of stress.
nb: forklare sentrale forhold rundt selvoppfatning og stressteori.

source: The teaching (2 hours per week) involves presentations and analyses with a focus on transferring relevant learning between different contexts.
nb: Undervisningen (2 timer per uke) innebærer presentasjon og analyse med fokus på å overføre relevant læring mellom ulike kontekster.

source: explain and demonstrate understanding of manner of operation, operation and monitoring of turbo engines.
nb: forklare og vise forståelse for virkemåter, operering og overvåking av turbomaskineri.

source: Lectures, flipped classroom, tests, group work, student presentations and exercises
nb: Forelesninger, "Flipped classroom" (omvendt klasserom), prøver, gruppearbeid, studentpresentasjoner og øvinger

source: Describe the disciplines history, traditions, distinctive character and place in the Armed Forces.
nb: Beskrive fagområdets historie, tradisjoner, egenart og plass i Forsvaret.

source: analyse key conditions affecting international cooperation and conflict, including states security policy and strategy.
nb: analysere forhold som påvirker internasjonalt samarbeid og konflikt, herunder staters sikkerhetspolitikk og strategi.

source: International regulations, IMO and SOLAS.
nb: Internasjonale regelverk, IMO og SOLAS.

source: Management and operation of marine steam systems, boiler and turbine generator on simulator.
nb: Operasjon og drift av skipsdampanlegg, kjele og turbingenerator på simulator.

source: Lectures, assignment solving, group/plenary discussions, reflection log, news briefs in English, “Letter of Introduction” and case studies
nb: Forelesninger, oppgaveløsning, gruppe-/plenumsdiskusjoner, refleksjonslogg, nyhetsbriefer på engelsk, «Letter of Introduction» og tilfellestudier

source: Syllabus and literature
nb: Pensum og litteratur

source: discuss the basic features, developments and influencing conditions of Norwegian security and defence policies during and after the Cold War, including current security challenges and practices for Norway.
nb: drøfte grunntrekk, utviklingen og påvirkende forhold i norsk sikkerhets- og forsvarspolitikk under og etter den kalde krigen, herunder aktuelle sikkerhetsutfordringer og handlemåter for Norge.

source: Each cadet shall also select and identify at least 180 pages in connection to their term paper
nb: Hver kadett skal i tillegg velge og angi minst 180 sider valgfritt pensum i tilknytning til sitt valg av emne for semesteroppgave.

source: become aware of own role as military cyber engineer and of management of military Communication and Information Systems (CIS) and cyber operations in particular, and the first service location in particular.
nb: bli bevisst på egen rolle som militær cyberingeniør og på ledelse av militære Communication and Information Systems(CIS)- og cyberoperasjoner generelt, og første tjenestested spesielt.

source: Naval Power and Security Studies (NPSS)
nb: Sjømakt og tryggleiksstudier (ST)

source: understand and explain how Norwegian and international security policies provide framework conditions and prerequisites for military decision-making at a strategic and operational level.
nb: forstå og forklare hvordan norsk og internasjonal sikkerhetspolitikk utgjør rammebetingelser og forutsetninger for militær beslutningstaking på strategisk og operasjonelt nivå.

source: • use computer tools to draw schematics for, perform simulations of and create print-outs for simple electrical circuits
nb: • benytte dataverktøy til å tegne skjema for, foreta simulering på og lage printutlegg for enkle elektriske kretser

source: and understand the connection between physical capabilities and mental capacity, and why this correlation is of great importance to the success of operations, and in operational work within the Royal Norwegian Air Force.
nb: og forstå sammenhengen mellom fysisk yteevne og mental kapasitet, og hvorfor denne sammenhengen er av stor betydning for prestasjoner i operasjoner, og i operativt virke i Luftforsvaret.

source: Identify your own and others’ educational and developmental needs and take responsibility for your own and others' development as officers
nb: identifisere egne og andres lærings- og utviklingsbehov og ta ansvar for sin egen og andres utvikling som offiser

source: describe various security policy strategies and means, and discuss strategy choices with an emphasis on the freedom to act for small states and their approach to military force.
nb: redegjøre for ulike sikkerhetspolitiske strategier og virkemidler og drøfte strategivalg med vekt på småstaters handlingsrom og tilnærming til militærmakt.

source: In addition, the cadets will be introduced to general principles and methods of individual and social learning.
nb: I tillegg skal kadettene bli introdusert for generelle prinsipper og metoder for individuell og sosial læring.

source: knowledge of a vessel's seaworthiness (civil and military)
nb: kunnskap om et fartøys sjødyktighet (sivilt og militært)

source: Methods and tools to implement successful projects in the Armed Forces, and knowledge of Prinsix as project tool and process.
nb: Metoder og verktøy for å gjennomføre vellykkede prosjekter i Forsvaret, og kjennskap til prinsix som prosjektverktøy og prosess.

source: The course provides a basis in computer modelling, databases, object-oriented programming and network communication.
nb: Emnet gir grunnlag i datamodellering, databaser, objektorientert programmering og systemer som kommuniserer i nettverk.

source: describe planning and timing of preparation and maintenance of technical ship systems.
nb: beskrive planlegging og tidfesting av klargjøring og vedlikehold av skipstekniske anlegg og systemer.

source: Lectures, compulsory Octave assignment, compulsory exercises and presentation with hearing.
nb: Forelesninger, obligatorisk Octave-oppgave, obligatoriske øvinger og presentasjon med høring.

source: Total: 100 pages (completed by start of course)
nb: Antall sider: 100 (kompletteres før emne start)

source: Assignment solving and review of assignments by student/teacher,
nb: Oppgaveløsning og oppgavegjennomgåelse av elev/lærer,

source: discuss organisational, inter-organisational, and cultural assumptions for effective and efficient logistics, as well as the role commercial actors play for logistics support to military operations.
nb: drøfte organisatoriske, inter-organisatoriske og kulturelle forutsetninger for effektiv logistikk, samt sivile aktørers betydning for gjennomføring av militære operasjoner.

source: Progression in a MPN exercise:
nb: Gangen i en øvelse i MPN:

source: In the event of failing programming, the remaining 2/3 of the overall grade, resit will be a 4-hour partial exam.
nb: Hvis stryk i programmering, den andre 2/3 av totalkarakteren, vil kontinuasjon være en 4 timers deleksamen.

source: explain the importance of communication and cultural understanding in military operations, as well as use English for giving commands with an emphasis on marine military terminology/maritime English
nb: forklare betydningen av kommunikasjon og kulturforståelse i militære operasjoner, samt bruke engelsk som kommandospråk med vekt på sjømilitær terminologi / maritim engelsk

source: apply skills and relevant results from research and development work to resolve theoretical, technical and practical issues in the electrical, computer and weapon technology fields and justify their choices.
nb: anvende kunnskap og relevante resultater fra forsknings- og utviklingsarbeid for å løse teoretiske, tekniske og praktiske problemstillinger innenfor elektronikk-, data- og våpentekniske fag og begrunne sine valg.

source: • Introduction to scientific method, research, project work and CDE activities
nb: • Innføring i vitenskapelig metode, forskning, prosjektarbeid og CDE virksomhet

source: • Scripting in Bash and PowerShell • Course in Windows server
nb: • Scripting i Bash og PowerShell

source: describe the requirements to an officer’s operative performance in the Navy.
nb: beskrive kravene som stilles til en offisers operative yteevne i Sjøforsvaret

source: Following completion of the Master of Military Studies, a military employee achieves the educational level of Advanced Officer Education (VOU) within the Norwegian Armed Forces.
nb: Militært tilsatte oppnår utdanningsnivået videregående offisersutdanning (VOU) i Forsvaret ved fullført master i militære studier.

source: Apply models of development and change of organisation at the team and platoon level.
nb: anvende modeller for utvikling og endring av organisasjon på team og avdelingsnivå.

source: Basic Combat Skills Officer (GSF-O), as a tailor-made education package, is designed to shape the officer as a soldier and ensure they have the necessary basic skills to master the “demands of war” and lead a command (troop leader - level independent).
nb: Grunnleggende stridsferdigheter offiser (GSF-O) er å forstå som en skreddersydd utdanningspakke for å forme offiseren som soldat og sikre nødvendige basisferdigheter for å mestre "krigens krav" og føre kommando (troppefører - nivåuavhengig).

source: implement the establishment, as well as operate and maintain a geodatabase
nb: gjennomføre etablering, samt drifte og vedlikeholde en geodatabase

source: • point out basic relationships between mathematics and engineering applications.
nb: • påvise grunnleggende sammenhenger mellom matematikk og ingeniørfaglige anvendelser.

source: What tools are used to create international peace and security in the framework of UN peace operations?
nb: Hvilke virkemidler anvendes for å skape internasjonal fred og sikkerhet i rammen av FNs fredsoperasjoner?

source: In the event of fail on the overall grade, resit will be a 5 hour examination that makes up the entire grade.
nb: Hvis stryk på totalkarakteren, vil kontinuasjon være en 5 timers deleksamen som teller hele totalkarakteren.

source: explain what security monitoring, vulnerability mapping, penetration testing, digital forensics and analysis of malicious software is about, and the application of this in a technical and tactical perspective
nb: forklare hva sikkerhetsmessig overvåkning, sårbarhetskartlegging, penetrasjonstesting, digital etterforskning og analyse av ondsinnet programvare går ut på, og anvendelsen av dette i et teknisk og taktisk perspektiv

source: Some courses are taught by lecturers/teachers from NTNU Gjøvik, and the courses this applies to are apparent from the applicable course descriptions.
nb: Noen emner undervises av forelesere/lærere fra NTNU Gjøvik, de emner dette gjelder kommer fram av gjeldende emnebeskrivelser.

source: Only a few of the members have achieved the goal of 2 percent of GDP on defence, and the United States has recently increased pressure on its allies to spend more money on defence.
nb: Bare et fåtall av medlemmene har oppnådd målet om 2 prosent av BNP på forsvar, og USA har den siste tiden økt presset på sine allierte for å bruke mer penger på forsvar.

source: • use the current value, internal rate and payback methods
nb: • benytte metodene nåverdi, internrente og payback

source: • calculate electrical field strength and electrical forces
nb: • beregne elektrisk feltstyrke og elektriske krefter

source: The course Joint Military Operations 2 aims to ensure a specialised level of knowledge and skills concerning how joint military operations are planned, managed and implemented.
nb: Emne militære fellesoperasjoner 2 har til hensikt å sikre et fordypet kunnskaps- og ferdighetsnivå for hvordan militære fellesoperasjoner planlegges, ledes og gjennomføres.

source: account for the basic features, developments and influencing conditions of Norwegian security and defence policies during and after the Cold War, including total defence and allied cooperation.
nb: redegjøre for og forklare grunntrekk og utviklingslinjer i norsk sikkerhets- og forsvarspolitikk under og etter den kalde krigen, herunder innretningen av Forsvaret og totalforsvaret.

source: Introduction to the leadership of teams within the Royal Norwegian Air Force.
nb: Innføring i ledelse av team i Luftforsvaret.

source: reflect on his/her own professional practice as a navigator and adjust this under supervision
nb: reflektere over egen faglig utøvelse som navigatør og justere denne under veiledning

source: • calculate magnetic fields and magnetic forces
nb: • beregne magnetfelt og magnetiske krefter

source: If the first assessment unit, linear algebra is failed, resit will be a 4-hour written examination.
nb: Hvis stryk i første vurderingsenhet, lineær algebra, vil kontinuasjon være en 4 timers deleksamen.

source: Electrical, electronic and control systems at the support, operational and management levels.
nb: Elektriske og elektroniske anlegg og kontrollinstallasjoner på støttenivået, det operative nivået og ledelsesnivået.

source: account for and discuss political and legal frameworks for the Total Defence and national preparedness.
nb: redegjøre for og drøfte politiske og rettslige rammer for Totalforsvaret og den nasjonale beredskapen.
